In [2]:
import pandas as pd

In [3]:
a = {'Student':['David', 'Samuel', 'Terry', 'Evan'],
     'Age':['27', '24', '22', '32'],
     'Country':['UK', 'Canada', 'China', 'USA'],
     'Course':['Python','Data Structures','Machine Learning','Web Development'],
     'Marks':['85','72','89','76']}
df1 = pd.DataFrame(a)

In [4]:
df1

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [5]:
df1.iloc[0:2]
#In this  0:2 it will take 0th to 2nd row means 0 1 will be included but 2nd one will not be includes

  Student Age Country           Course Marks
0   David  27      UK           Python    85
1  Samuel  24  Canada  Data Structures    72

In [6]:
df1.iloc[0:2,0:3] 
# In this 0:2 it will be taking the 0th row to 2nd Row means 0 1 will be included and 0th column , 1st Column and 2nd column will be chosen but 3rd will not be taken

  Student Age Country
0   David  27      UK
1  Samuel  24  Canada